ldom22/EmbeddedTetris/Lib/mc9s12zvc192.c
/* * * * *  16-BIT REGISTERS  * * * * * * * * * * * * * * * */
volatile IVBRSTR _IVBR;                                    /* Interrupt Vector Base Register; 0x00000010 */
volatile MMCECSTR _MMCEC;                                  /* Error code register; 0x00000080 */
volatile MMCCCRSTR _MMCCCR;                                /* Captured S12ZCPU Condition Code Register Low; 0x00000082 */
volatile PTADSTR _PTAD;                                    /* Port AD Data Register; 0x00000280 */
volatile PTIADSTR _PTIAD;                                  /* Port AD Input Register; 0x00000282 */
volatile DDRADSTR _DDRAD;                                  /* Port AD Data Direction Register; 0x00000284 */
volatile PERADSTR _PERAD;                                  /* Port AD Pull Up Enable Register; 0x00000286 */
volatile PPSADSTR _PPSAD;                                  /* Port AD Polarity Select Register; 0x00000288 */
volatile PIEADSTR _PIEAD;                                  /* Port AD Interrupt Enable Register; 0x0000028C */
volatile PIFADSTR _PIFAD;                                  /* Port AD Interrupt Flag Register; 0x0000028E */
volatile DIENADSTR _DIENAD;                                /* Digital Input Enable Register; 0x00000298 */
volatile FCCOB0STR _FCCOB0;                                /* Flash Common Command Object Register; 0x0000038C */
volatile FCCOB1STR _FCCOB1;                                /* Flash Common Command Object Register; 0x0000038E */
volatile FCCOB2STR _FCCOB2;                                /* Flash Common Command Object Register; 0x00000390 */
volatile FCCOB3STR _FCCOB3;                                /* Flash Common Command Object Register; 0x00000392 */
volatile FCCOB4STR _FCCOB4;                                /* Flash Common Command Object Register; 0x00000394 */
volatile FCCOB5STR _FCCOB5;                                /* Flash Common Command Object Register; 0x00000396 */
volatile ECCDDSTR _ECCDD;                                  /* ECC Debug Data; 0x000003CC */
volatile TIM1TCNTSTR _TIM1TCNT;                            /* Timer Count Register; 0x00000404 */
volatile TIM1TC0STR _TIM1TC0;                              /* Timer Input Capture/Output Compare Register 0; 0x00000410 */
volatile TIM1TC1STR _TIM1TC1;                              /* Timer Input Capture/Output Compare Register 1; 0x00000412 */
volatile TIM1TC2STR _TIM1TC2;                              /* Timer Input Capture/Output Compare Register 2; 0x00000414 */
volatile TIM1TC3STR _TIM1TC3;                              /* Timer Input Capture/Output Compare Register 3; 0x00000416 */
volatile PWM0CNT01STR _PWM0CNT01;                          /* PWM0 Channel Counter 01 Register; 0x0000048C */
volatile PWM0CNT23STR _PWM0CNT23;                          /* PWM0 Channel Counter 23 Register; 0x0000048E */
volatile PWM0CNT45STR _PWM0CNT45;                          /* PWM0 Channel Counter 45 Register; 0x00000490 */
volatile PWM0CNT67STR _PWM0CNT67;                          /* PWM0 Channel Counter 67 Register; 0x00000492 */
volatile PWM0PER01STR _PWM0PER01;                          /* PWM0 Channel Period 01 Register; 0x00000494 */
volatile PWM0PER23STR _PWM0PER23;                          /* PWM0 Channel Period 23 Register; 0x00000496 */
volatile PWM0PER45STR _PWM0PER45;                          /* PWM0 Channel Period 45 Register; 0x00000498 */
volatile PWM0PER67STR _PWM0PER67;                          /* PWM0 Channel Period 67 Register; 0x0000049A */
volatile PWM0DTY01STR _PWM0DTY01;                          /* PWM0 Channel Duty 01 Register; 0x0000049C */
volatile PWM0DTY23STR _PWM0DTY23;                          /* PWM0 Channel Duty 23 Register; 0x0000049E */
volatile PWM0DTY45STR _PWM0DTY45;                          /* PWM0 Channel Duty 45 Register; 0x000004A0 */
volatile PWM0DTY67STR _PWM0DTY67;                          /* PWM0 Channel Duty 67 Register; 0x000004A2 */
volatile PWM1CNT01STR _PWM1CNT01;                          /* PWM1 Channel Counter 01 Register; 0x0000050C */
volatile PWM1CNT23STR _PWM1CNT23;                          /* PWM1 Channel Counter 23 Register; 0x0000050E */
volatile PWM1CNT45STR _PWM1CNT45;                          /* PWM1 Channel Counter 45 Register; 0x00000510 */
volatile PWM1CNT67STR _PWM1CNT67;                          /* PWM1 Channel Counter 67 Register; 0x00000512 */
volatile PWM1PER01STR _PWM1PER01;                          /* PWM1 Channel Period 01 Register; 0x00000514 */
volatile PWM1PER23STR _PWM1PER23;                          /* PWM1 Channel Period 23 Register; 0x00000516 */
volatile PWM1PER45STR _PWM1PER45;                          /* PWM1 Channel Period 45 Register; 0x00000518 */
volatile PWM1PER67STR _PWM1PER67;                          /* PWM1 Channel Period 67 Register; 0x0000051A */
volatile PWM1DTY01STR _PWM1DTY01;                          /* PWM1 Channel Duty 01 Register; 0x0000051C */
volatile PWM1DTY23STR _PWM1DTY23;                          /* PWM1 Channel Duty 23 Register; 0x0000051E */
volatile PWM1DTY45STR _PWM1DTY45;                          /* PWM1 Channel Duty 45 Register; 0x00000520 */
volatile PWM1DTY67STR _PWM1DTY67;                          /* PWM1 Channel Duty 67 Register; 0x00000522 */
volatile TIM0TCNTSTR _TIM0TCNT;                            /* Timer Count Register; 0x000005C4 */
volatile TIM0TC0STR _TIM0TC0;                              /* Timer Input Capture/Output Compare Register 0; 0x000005D0 */
volatile TIM0TC1STR _TIM0TC1;                              /* Timer Input Capture/Output Compare Register 1; 0x000005D2 */
volatile TIM0TC2STR _TIM0TC2;                              /* Timer Input Capture/Output Compare Register 2; 0x000005D4 */
volatile TIM0TC3STR _TIM0TC3;                              /* Timer Input Capture/Output Compare Register 3; 0x000005D6 */
volatile TIM0TC4STR _TIM0TC4;                              /* Timer Input Capture/Output Compare Register 4; 0x000005D8 */
volatile TIM0TC5STR _TIM0TC5;                              /* Timer Input Capture/Output Compare Register 5; 0x000005DA */
volatile TIM0TC6STR _TIM0TC6;                              /* Timer Input Capture/Output Compare Register 6; 0x000005DC */
volatile TIM0TC7STR _TIM0TC7;                              /* Timer Input Capture/Output Compare Register 7; 0x000005DE */
volatile TIM0PACNTSTR _TIM0PACNT;                          /* Pulse Accumulators Count Register; 0x000005E2 */
volatile ADC0CTLSTR _ADC0CTL;                              /* ADC0 Control Register; 0x00000600 */
volatile ADC0CONIESTR _ADC0CONIE;                          /* ADC0 Conversion Interrupt Enable Register; 0x0000060A */
volatile ADC0CONIFSTR _ADC0CONIF;                          /* ADC0 Conversion Interrupt Flag Register; 0x0000060C */
volatile ADC0IMDRISTR _ADC0IMDRI;                          /* ADC0 Intermediate Result Information Register; 0x0000060E */
volatile CPMUAPIRSTR _CPMUAPIR;                            /* Autonomous Periodical Interrupt Rate Register; 0x000006D4 */
volatile CPMUIRCTRIMSTR _CPMUIRCTRIM;                      /* CPMU IRC1M Trim Registers; 0x000006D8 */
volatile SCI0BDSTR _SCI0BD;                                /* SCI 0 Baud Rate Register; 0x00000700 */
volatile SCI1BDSTR _SCI1BD;                                /* SCI 1 Baud Rate Register; 0x00000710 */
volatile SPI0DRSTR _SPI0DR;                                /* SPI 0 Data Register; 0x00000784 */
volatile SPI1DRSTR _SPI1DR;                                /* SPI 1 Data Register; 0x00000794 */
volatile CAN0RXTSRSTR _CAN0RXTSR;                          /* MSCAN0 Receive Time Stamp Register; 0x0000082E */
volatile CAN0TXTSRSTR _CAN0TXTSR;                          /* MSCAN0 Transmit Time Stamp Register; 0x0000083E */
volatile TICKRATESTR _TICKRATE;                            /* SENT Transmitter Tick Rate Register; 0x000009A0 */
volatile PPULSESTR _PPULSE;                                /* SENT Transmitter Pause-Pulse Register; 0x000009A2 */
volatile CONFIGSTR _CONFIG;                                /* SENT Transmitter Configuration Register; 0x000009A4 */
/* BAKEY0 - macro for reading non volatile register        Backdoor Comparison Key 0; 0x00FFFE00 */
/* Tip for register initialization in the user code:  const byte BAKEY0_INIT @0x00FFFE00 = <BAKEY0_INITVAL>; */
/* BAKEY1 - macro for reading non volatile register        Backdoor Comparison Key 1; 0x00FFFE02 */
/* Tip for register initialization in the user code:  const byte BAKEY1_INIT @0x00FFFE02 = <BAKEY1_INITVAL>; */
/* BAKEY2 - macro for reading non volatile register        Backdoor Comparison Key 2; 0x00FFFE04 */
/* Tip for register initialization in the user code:  const byte BAKEY2_INIT @0x00FFFE04 = <BAKEY2_INITVAL>; */
/* BAKEY3 - macro for reading non volatile register        Backdoor Comparison Key 3; 0x00FFFE06 */
/* Tip for register initialization in the user code:  const byte BAKEY3_INIT @0x00FFFE06 = <BAKEY3_INITVAL>; */
/* PROTKEY - macro for reading non volatile register       Non Volatile Protection Override Comparison Key; 0x00FFFE08 */
/* Tip for register initialization in the user code:  const byte PROTKEY_INIT @0x00FFFE08 = <PROTKEY_INITVAL>; */


/* * * * *  32-BIT REGISTERS  * * * * * * * * * * * * * * * */
volatile PARTIDSTR _PARTID;                                /* Part ID Register; 0x00000000 */
volatile ADC0CMDSTR _ADC0CMD;                              /* ADC0 Command Register; 0x00000614 */
volatile TXBUFSTR _TXBUF;                                  /* SENT Transmit Buffer Register; 0x000009A8 */


/* * * * *  24-BIT ADDRESS REGISTERS  * * * * * * * * * * * * * * * * * * * * * * */
volatile void* volatile MMCPC;                             /* Captured S12ZCPU Program Counter Low; 0x00000087 */
volatile void* volatile DBGAA;                             /* Debug Comparator A Address Register Low; 0x00000117 */
volatile void* volatile DBGBA;                             /* Debug Comparator B Address Register Low; 0x00000127 */
volatile void* volatile DBGDA;                             /* Debug Comparator D Address Register Low; 0x00000147 */
volatile void* volatile ECCDPTR;                           /* ECC Debug Point Register Low; 0x000003C9 */
volatile void* volatile ADC0CBP;                           /* ADC0 Command Base Pointer Register 0; 0x000003C9 */
volatile void* volatile ADC0RBP;                           /* ADC0 Result Base Pointer Register 0; 0x000003C9 */



/*lint -restore */

/* EOF */
